argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
  uint8_t iptxt[64];
  uint8_t request[512];
  
  ip4_addr_t local_ip; 
  ip4_addr_t remote_ip; 
  
  const char* key = "WTN6FH385TCUNDMU";
  const char* request_fmt = "GET /update?api_key=%s&field1=%d HTTP/1.0\r\nHost: mywebsite.com\r\n\r\n ";
  const char* server = "thingspeak.com";

  /* init code for LWIP */
  MX_LWIP_Init();
  
  /* Check interface status */
  if (netif_is_up(netif))
  {
    DHCP_state = DHCP_START;
  }
  else
  {  
    DHCP_state = DHCP_LINK_DOWN;
    cli_printf("The network cable is not connected \r\n");
  }

  /* Infinite loop */
  for(;;)
  {
    if(xQueueReceive(tcpQueueHandle, &data, 0) == pdTRUE)
    {
      cli_printf("[Queue] Model -> %s (data = %u)\r\n", __func__, data);

      if (DHCP_state == DHCP_ADDRESS_ASSIGNED)
      {
        /* Create a new TCP connection handle */
        conn = netconn_new(NETCONN_TCP);        
        if (conn == NULL)
        {
          cli_printf("[LWIP] netconn_new : FAILED\r\n");
        }
        else
        {
#if 0 
          /* Bind a netconn to a specific local IP address and port (optional) */
          err = netconn_bind(conn, &netif->ip_addr, 0 );
          if (err != ERR_OK)
          {
            cli_printf("[LWIP] netconn_bind: ERR (%d)\r\n", err);
          }
          else
#endif
          {
            err = netconn_gethostbyname(server, &remote_ip);
            if (err != ERR_OK)
            {
              cli_printf("[LWIP] netconn_gethostbyname: ERR (%d)\r\n", err);
            }
            else
            {
              sprintf((char *)iptxt, "%s", ip4addr_ntoa((const ip4_addr_t *)&remote_ip));   
              cli_printf("Remote IP address to server: %s (%s)\r\n", server, iptxt);
              
              /* Connect to server */
              err = netconn_connect(conn, &remote_ip, 80); 
              if (err != ERR_OK)
              {
                cli_printf("[LWIP] netconn_connect: ERR (%d)\r\n", err);
              }
              else
              {
                cli_printf("Connected to server: %s\r\n", server);
                sprintf((char *)request, request_fmt, key, data, server);  
                
                /* Write data to server */
                err = netconn_write(conn, request, strlen((char*)request), NETCONN_NOFLAG);
                if (err != ERR_OK)
                {
                  cli_printf("[LWIP] netconn_write: ERR (%d)\r\n", err);
                }
                else
                {
                  cli_printf("[LWIP] netconn_write:\r\n%s \r\n", request);
                  
                  /* Get pointer to buffer where response data is stored */
                  while (( err = netconn_recv(conn, &netbuf)) == ERR_OK)
                  {
                      do
                      {
                        /* Get pointer to data and length*/
                        netbuf_data(netbuf, &buf_data, &buf_len);
                        
                        /* Print data to console */
                        cli_write((char*)buf_data, buf_len);
                      }
                      while (netbuf_next(netbuf) >= 0);
                      
                      /* Free data buffer */
                      netbuf_delete(netbuf);
                  }
                  
                  cli_printf("\r\n");
                  
                  if ((err != ERR_OK) && (err != ERR_CLSD))
                  {
                    cli_printf("[LWIP] netconn_recv: ERR (%d)\r\n", err);
                  }
                }
                
                /* Close connection from local side */
                err = netconn_close(conn);
                if (err != ERR_OK)
                {
                  cli_printf("[LWIP] netconn_close: ERR (%d)\r\n", err);
                }
              }
            }
          }
        }

        /* Delete TCP connection */
        err = netconn_delete(conn);  
        if (err != ERR_OK)
        {
          cli_printf("[LWIP] netconn_close: ERR (%d)\r\n", err);
        }
      }
    }
    
    osDelay(10);
  }
  /* USER CODE END StartLWIPTask */
}

/* USER CODE BEGIN Header_StartDHCPTask */
/**
* @brief Function implementing the dhcpTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartDHCPTask */
void StartDHCPTask(void const * argument)
{
  /* USER CODE BEGIN StartDHCPTask */

  struct netif* netif = (struct netif*)argument;
  ip_addr_t ipaddr;
  ip_addr_t netmask;
  ip_addr_t gw;
  struct dhcp *dhcp;
  uint8_t iptxt[20];
  
  /* Get DHCP instance */
  dhcp = (struct dhcp *)netif_get_client_data(netif, LWIP_NETIF_CLIENT_DATA_INDEX_DHCP);
  
  for (;;)
  {
    switch (DHCP_state)
    {
    case DHCP_START:
      {
        ip_addr_set_zero_ip4(&netif->ip_addr);
        ip_addr_set_zero_ip4(&netif->netmask);
        ip_addr_set_zero_ip4(&netif->gw);       
        dhcp_start(netif);
        DHCP_state = DHCP_WAIT_ADDRESS;
        cli_printf("[DHCP] Looking for server ...\r\n");
      }
      break;
      
    case DHCP_WAIT_ADDRESS:
      {                
        if (dhcp_supplied_address(netif)) 
        {
          DHCP_state = DHCP_ADDRESS_ASSIGNED;	
          sprintf((char *)iptxt, "%s", ip4addr_ntoa((const ip4_addr_t *)&netif->ip_addr));   
          cli_printf("[DHCP] Supplied address: %s\r\n", iptxt);
        }
        else
        {
          dhcp = (struct dhcp *)netif_get_client_data(netif, LWIP_NETIF_CLIENT_DATA_INDEX_DHCP);
    
          /* DHCP timeout */
          if (dhcp->tries > MAX_DHCP_TRIES)
          {
            DHCP_state = DHCP_TIMEOUT;
            
            /* Stop DHCP */
            dhcp_stop(netif);
            
            /* Static address used */
            IP_ADDR4(&ipaddr, IP_ADDR0 ,IP_ADDR1 , IP_ADDR2 , IP_ADDR3 );
            IP_ADDR4(&netmask, NETMASK_ADDR0, NETMASK_ADDR1, NETMASK_ADDR2, NETMASK_ADDR3);
            IP_ADDR4(&gw, GW_ADDR0, GW_ADDR1, GW_ADDR2, GW_ADDR3);
            netif_set_addr(netif, ip_2_ip4(&ipaddr), ip_2_ip4(&netmask), ip_2_ip4(&gw));
            
