argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
            sprintf((char *)iptxt, "%s", ip4addr_ntoa((const ip4_addr_t *)&netif->ip_addr));
            cli_printf("[DHCP] Timeout\r\n");
            cli_printf("[DHCP] Static IP address: %s\r\n", iptxt);
          }
        }
      }
      break;
    case DHCP_LINK_DOWN:
      {
        /* Stop DHCP */
        dhcp_stop(netif);
        DHCP_state = DHCP_OFF; 
      }
      break;
    default: 
      break;
    }
    
    /* wait 250 ms */
    osDelay(250);
  }
  
#if 0  
  /* Infinite loop */
  for(;;)
  {
    memset(PAGE_BODY, 0,256);
    /* The list of tasks and their status */
    osThreadList((unsigned char *)PAGE_BODY);

    cli_printf("\r\nName          State  Priority  Stack   Num\r\n" );
    cli_printf("---------------------------------------------\r\n");
    cli_write((char*)PAGE_BODY, strlen((char*)PAGE_BODY));
    cli_printf("---------------------------------------------\r\n");
    cli_printf("B : Blocked, R : Ready, D : Deleted, S : Suspended\r\n");
    osDelay(1000);
  }
#endif

  /* USER CODE END StartDHCPTask */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
    /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
       tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
